# Box Office Film Analysis For Microsoft Movie Studio

## Overview

This project analyzes film analytics in the box office. Exploratory analysis of the data shows the genres associated with an above average rating, as well as also investigating the relatoonship between various variables in the dataset. Microsoft can use the analysis to understand what type of movies to start showing as well as the market they could target.

## Business Problem
To start the movie studio, relevant and accurate information on various titles is required. This will in the log run help save on start-up costs for the movie studio by doing what works and avoiding the hit or miss. This is crucial as it could determine whether the movie studio becomes popular and successful or whether it ends up failing. I explore the data to find genres that may be the best to start with and also investigate relationships that might have an impact on ratings.

## Data Understanding

The Box Office has a dataset on various movie titles. Every title has a unique id associated with its genre, start year, run time,original title, average rating and the number of votes ladng up to the rating.

In [2]:
import pandas as pd

### Title Basics Data

In [3]:
title_basics=pd.read_csv('zippedData/imdb.title.basics.csv.gz')

title_basics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [4]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

### Title Ratings Data

In [5]:
title_ratings=pd.read_csv('zippedData/imdb.title.ratings.csv.gz')

title_ratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [6]:
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

### Movie Gross Data

In [7]:
movie_gross=pd.read_csv('zippedData/bom.movie_gross.csv.gz')
movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [8]:
movie_gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

## Data preparation

### Data Cleaning
I make the data easier to work with by checking for null values and dealing with the missing data, checking for duplicates and renaming some columns.

#### Title Basics Data Cleaning

In [9]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [10]:
#replacing null values
title_basics['original_title'].fillna('Unknown',inplace=True)

title_basics['runtime_minutes'].fillna(title_basics['runtime_minutes'].median(),inplace=True)
title_basics['genres'].fillna('Unknown',inplace=True)

In [11]:
# Checking whether all columns are now filled 
title_basics.isna().sum()

tconst             0
primary_title      0
original_title     0
start_year         0
runtime_minutes    0
genres             0
dtype: int64

In [12]:
#Checking for duplicates
title_basics_duplicates=title_basics[title_basics.duplicated()]
print(len(title_basics_duplicates))
title_basics_duplicates.head()

0

Empty DataFrame
Columns: [tconst, primary_title, original_title, start_year, runtime_minutes, genres]
Index: []

#### Title Ratings Data Cleaning

In [13]:
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [14]:
#Checking for null values
title_ratings.isna().sum()

tconst           0
averagerating    0
numvotes         0
dtype: int64

In [15]:
#Checking for duplicates
title_ratings_duplicates=title_ratings[title_ratings.duplicated()]
print(len(title_ratings_duplicates))
title_ratings_duplicates.head()

0

Empty DataFrame
Columns: [tconst, averagerating, numvotes]
Index: []

#### Movie Gross Data Cleaning

In [16]:
movie_gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [17]:
# changing foreign gross to a numerical value
movie_gross['foreign_gross'].replace(',','', regex=True, inplace=True)
movie_gross['foreign_gross']=pd.to_numeric(movie_gross['foreign_gross'],errors = 'coerce')
movie_gross['foreign_gross'].dtype

dtype('float64')

In [18]:
#Replacing null values
movie_gross['studio'].fillna('Unknown',inplace=True)

movie_gross['domestic_gross'].fillna(movie_gross['domestic_gross'].median(),inplace=True)

movie_gross['foreign_gross'].fillna(movie_gross['foreign_gross'].median(),inplace=True)

In [20]:
#Checking for null values
movie_gross.isna().sum()

title             0
studio            0
domestic_gross    0
foreign_gross     0
year              0
dtype: int64

In [21]:
# checking for duplicates
movie_gross_duplicates=movie_gross[movie_gross.duplicated()]
print(len(movie_gross_duplicates))
movie_gross_duplicates.head()

0

Empty DataFrame
Columns: [title, studio, domestic_gross, foreign_gross, year]
Index: []

### Merging Datasets
I merge the title basics and title ratings dataset using the title unique id `t_const`.

In [22]:
titles_and_ratings=pd.merge(title_basics,title_ratings, on='tconst',how='left')
titles_and_ratings.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77.0
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43.0
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517.0
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,87.0,"Comedy,Drama",6.1,13.0
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119.0

Merging the datasets yields a single dataset for feature engineering and data analysis.

### Feature Engineering
 I Create a `total_gross` variable to find total gross for each title.

In [23]:
# Creating total_gross variable to find total gross for each title
movie_gross['total_gross']=movie_gross['domestic_gross']+movie_gross['foreign_gross']

movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year,total_gross
0,Toy Story 3,BV,415000000.0,652000000.0,2010,1.067000e+09
1,Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010,1.025500e+09
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000.0,2010,9.603000e+08
3,Inception,WB,292600000.0,535700000.0,2010,8.283000e+08
4,Shrek Forever After,P/DW,238700000.0,513900000.0,2010,7.526000e+08

In [24]:
#Saving cleaned data as csv

titles_and_ratings.to_csv('./cleaned_titles_and_ratings.csv')
movie_gross.to_csv('./cleaned_movie_gross.csv')